//#include <stdio.h>
//int main()
//{
//	int a = 1;
//	char *p = (char*)&a;
//	if (*p==1)
//	{
//		printf("这个是小端\n");
//	}
//	else
//	{
//		printf("这个是大端\n");
//	}
//	return 0;
//}


//#include <stdio.h>
//int chenck_sys()
//{
//	int a = 1;
//	char *p = (char*)&a;
//返回1是小端  返回0是大端  
//	return *p;
//}
//
//int main()
//{
//	int a = chenck_sys();
//	if (a==1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//#include <stdio.h>
//
//int main()
//{
//	char a = -1;
//	//10000001
//	//11111110
//	//11111111
//	//11111111111111111111111111111111
//	signed char b = -1;
//	//10000001
//	//11111110
//	//11111111
//	//11111111111111111111111111111111
//	unsigned char c = -1;
//	//10000001
//	//11111110
//	//11111111
//	//00000000000000000000000011111111
//	//00000000000000000000000011111110
//	//11111111111111111111111100000001
//	printf("  %d   %d    %d\n", a, b, c);
//	return 0;
//}